Repository: Agentew04/Mercury
Catalog: Mercury.Editor/Assets/Localization/FileEditorResources.*.resx
Languages: pt_br

# EditMessage
source: Editing {0}
pt_br: Editando {0}

# BuildButtonTooltip
source: Build
pt_br: Montar

# RunButtonTooltip
source: Run
pt_br: Executar

# SaveButtonTooltip
source: Save File
pt_br: Salvar arquivo

# CancelPopupText
source: Cancel
pt_br: Cancelar

# ConfirmPopupText
source: Confirm
pt_br: Confirmar

# ProblemFileColumn
source: File
pt_br: Arquivo

# ProblemLineColumn
source: Line
pt_br: Linha

# ProblemMessageColumn
source: Message
pt_br: Mensagem

# NoOpenFilesText
source: No files open
pt_br: Nenhum arquivo aberto

# IntellisenseAsciizDataDescription
source: Defines a string with a '\0' end delimeter
pt_br: Define uma string com terminador '\0'

# IntellisenseAsciiDataDescription
source: Defines a string without a '\0' end delimiter
pt_br: Define uma string sem terminador '\0'

# IntellisenseDataSectionDescription
source: Declares the start of the data section
pt_br: Declara o início da seção de dados

# IntellisenseDoubleDataDescription
source: Defines a 64 bit floating point number
pt_br: Define um número de ponto flutuante de 64 bits

# IntellisenseFloatDataDescription
source: Defines a 32 bit floating point number
pt_br: Define um número de ponto flutuante de 32 bits

# IntellisenseGloblDescription
source: Marks a symbol as accessible by other files
pt_br: Marca um símbolo como acessível em outros arquivos

# IntellisenseMacroEndDescription
source: Ends a macro definition
pt_br: Termina uma definição de macro

# IntellisenseMacroStartDescription
source: Starts a macro definition
pt_br: Começa uma definição de macro

# IntellisenseSpaceDataDescription
source: Defines an array of bytes
pt_br: Define um vetor de bytes

# IntellisenseTextSectionDescription
source: Declares the start of the text section
pt_br: Declara o início da seção de instruções

# IntellisenseWordDataDescription
source: Defines a 32 bit integer number
pt_br: Define um número de 32 bits inteiro

# IntellisenseAlignDescription
source: Sets the alignment of the data
pt_br: Determina o alinhamento dos dados
